WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/DocLitW/SoapWsdl.BaseDataTypes.XmlFormatter.DocLitWrapped_RetAnyUri_Client_Request-9.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesDocLitW/RetAnyUri</a:Action>
    <a:MessageID>urn:uuid:84da9ed0-9593-45c9-bc5a-606554f037af</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetAnyUri xmlns="http://tempuri.org/">
      <inUri>http://localhost/Hello%20World/New%20Document.html</inUri>
    </RetAnyUri>
  </s:Body>
</s:Envelope>